*** find word in a file and print the line
    :LOGBOOK:
    CLOCK: [2020-03-22 Sun 17:24]--[2020-03-22 Sun 18:05] =>  0:41
    :END:
    [[~/Documents/Snippet/CPP/primer-12-3.cpp][cpp file]]

** DONE C++ Project Framework                                          :NOTE:
   CLOSED: [2020-03-31 Tue 21:41] DEADLINE: <2020-03-30 Mon 22:00>
   :PROPERTIES:
   :ID:       1D8F715F-A30B-432C-AA70-63D1FE8545E7
   :END:
   :LOGBOOK:
   CLOCK: [2020-03-05 Thu 18:12]--[2020-03-05 Thu 18:14] =>  0:02
   :END:
   [2020-03-05 Thu 18:12]

*** DONE recursive programming                                         :NOTE:
    CLOSED: [2020-03-29 Sun 21:47] SCHEDULED: <2020-03-29 Sun 20:00-21:00>
    :PROPERTIES:
    :ID:       4999E010-DE33-4CBC-AA65-1169D96F9FB4
    :END:
    - State "FINISHED"   from "CANCELLED"  [2020-03-29 Sun 21:47]
    :LOGBOOK:
    CLOCK: [2020-03-05 Thu 09:46]--[2020-03-05 Thu 09:49] =>  0:03
    :END:
    [2020-03-05 Thu 09:46]
    使用递归：每次固定操作可以减少问题的 n（可能是一个多维 n^m 的问题）
    递归函数：如何表示 n，递归操作，终止条件

    [[https://mp.weixin.qq.com/s/mJ_jZZoak7uhItNgnfmZvQ][递归及其优化参考文章]]

** DONE C++ Network Lib: asio
   CLOSED: [2020-04-15 Wed 16:04]
   :LOGBOOK:
   CLOCK: [2020-04-10 Fri 15:51]--[2020-07-02 Thu 17:38] => 1993:47
   :END:

 resource:
 - [[http://think-async.com/Asio/asio-1.16.0/doc/][HTML documentation (non-Boost)]]

 Asio is a *cross-platform* C++ library for network and *low-level I/O programming* that provides developers with a *consistent asynchronous* model using a modern C++ approach

 Asio has two versions: standalone asio without boost; with boost

***** DONE DNS
      CLOSED: [2020-08-18 Tue 10:21]
      :LOGBOOK:
      CLOCK: [2020-08-18 Tue 10:05]--[2020-08-18 Tue 10:21] =>  0:16
      :END:

***** DONE P2P
      CLOSED: [2020-08-18 Tue 11:10]
      :LOGBOOK:
      CLOCK: [2020-08-18 Tue 10:37]--[2020-08-18 Tue 11:09] =>  0:32
      :END:
      激励机制：一报还一报。
      追踪器标记是否在洪流中；
      选择部分对等方建立并行 TCP 链接，询问对等方的块列表；
      请求最稀缺的块，优先发送最高速率的邻居

***** socket 编程
      :LOGBOOK:
      CLOCK: [2020-08-18 Tue 11:13]--[2020-08-18 Tue 11:29] =>  0:16
      :END:
  UDP 服务器不用监听通道，收到就处理。

** DONE C++ string                                                     :NOTE:
   CLOSED: [2020-03-28 Sat 20:40]
   :PROPERTIES:
   :ID:       60694708-4932-4F29-AF30-E839E71A61A0
   :END:
   :LOGBOOK:
   CLOCK: [2020-03-06 Fri 09:27]--[2020-03-06 Fri 09:28] =>  0:01
   :END:
 [2020-03-06 Fri 09:27]

**** for in const string
     :LOGBOOK:
     CLOCK: [2020-03-06 Fri 10:49]--[2020-03-06 Fri 11:03] =>  0:14
     :END:
 #+begin_src C++ :includes <iostream> <string> <cctype> :namespaces std
   int main(){
       // const string str_const = "Hello World";
       string str_const = "Hello World";
       for(auto & c : str_const)
           c = toupper(c);

       cout << str_const;

       return 0;
   }
 #+end_src

 #+RESULTS:
 : HELLO WORLD

  *ps:* cannot change const string
** think about string
   :LOGBOOK:
   CLOCK: [2020-03-03 Tue 10:40]--[2020-03-03 Tue 10:45] =>  0:05
   :END:
 [2020-03-03 Tue 10:40]

** DONE thinking about recursive
   CLOSED: [2020-07-02 Thu 18:49]
   :PROPERTIES:
   :ID:       B3B9ACA2-3E58-4986-829D-75226C2D3BF5
   :END:
   :LOGBOOK:
   CLOCK: [2020-03-03 Tue 11:01]--[2020-03-03 Tue 11:03] =>  0:02
   :END:
 [2020-03-03 Tue 11:01]

**** DONE chapter10:系统 IO
     CLOSED: [2020-08-03 Mon 09:56] DEADLINE: <2020-08-03 Mon 09:55> SCHEDULED: <2020-08-03 Mon 09:00>
     :LOGBOOK:
     CLOCK: [2020-08-03 Mon 09:00]--[2020-08-03 Mon 09:25] =>  0:25
     :END:
 Linux 内核提供三个标准的数据结构表示打开的文件：描述符表、打开文件表、vnode 表

 Linux 的读和写操作会出现不足值

 Linux 函数能够提供元数据，C标准函数不能提供

***** RIO 函数和 C 标准 IO 函数
      :LOGBOOK:
      CLOCK: [2020-08-03 Mon 09:30]--[2020-08-03 Mon 09:55] =>  0:25
      :END:
 常见业务使用 C 标准函数，网络文件使用 RIO

**** DONE chapter11:网络编程
     CLOSED: [2020-08-04 Tue 09:39] SCHEDULED: <2020-08-03 Mon 19:00>
     :LOGBOOK:
     CLOCK: [2020-08-03 Mon 20:36]--[2020-08-03 Mon 21:05] =>  0:29
     CLOCK: [2020-08-03 Mon 20:02]--[2020-08-03 Mon 20:27] =>  0:25
     CLOCK: [2020-08-03 Mon 19:27]--[2020-08-03 Mon 19:52] =>  0:25
     CLOCK: [2020-08-03 Mon 18:57]--[2020-08-03 Mon 19:22] =>  0:25
     :END:
 [[file+emacs:~/Documents/Snippet/CPP/Network/echo/client.c][echo demo]]

**** DONE chapter12:并发编程
     CLOSED: [2020-08-04 Tue 21:56] DEADLINE: <2020-08-04 Tue 21:00>
     :LOGBOOK:
     CLOCK: [2020-08-04 Tue 09:47]--[2020-08-04 Tue 10:21] =>  0:34
     :END:

***** 线程
      :LOGBOOK:
      CLOCK: [2020-08-04 Tue 15:31]--[2020-08-04 Tue 16:19] =>  0:48
      :END:
